# for i in range(20):
#      print(i)
"""
for ეს არის ციკლის keyword
i არის საიტერაციო ცვლადი (იტერაცია = განმეორება)
in არის ში ხოლო in range ნიშნავს დიაპაზონში
range(20) ნიშნავს, რომ შეიქმნება მათემატიკური მიმდევრობა რომლის სიგრძეც არის 20
range არის მეთოდი, რომელსაც არგუმენტად გადაეცა მნიშვნელობა 20
"""

# i = 42
# while i < 41:
#     print(i)
#     i += 1

# i = 0 ეს არის საიტერაციო ცვლადის დეკლარაცია
# while(სანამ) ეს არის ციკლის შესაქმნელად საჭირო keyword
# ციკლი იმუშავებს იქამდე სანამ i < 41 
# თითოეულ დატრიალებაზე დაიპრინტება ჩვენი საიტერაციო ცვლადი i
# რომელიც მნიშვნელობას იზრდის ერთით თითოეულ იტერაციაზე 
# i += 1 ეს არის საიტერაციო ინკრემენტაცია (გაზრდა)
# indented ეს არის ინდენტაცია (Tab ღილაკით გამოყოფა კედლისგან)
    
    
# print (5 == 5) 
# print (5 == 7)  
# print (5 != 7)
# print (5 != 5)
# print (5 <= 5)
# print (5 >= 5)

# guess = int(input("enter your password: "))
# password = 1
# while guess != password: 
#     guess = int(input("enter your password: ")) 
# print("password is correct")